{
    "basic_info": {
      "description_header": "Hi!",
      "description": "👋 I'm Andrei Ocsan, in my early twenties and majoring⁠ in System Development in BSIT, currently enrolled in Pangasinan's PHINMA University. I am originally from the enchanting Pangasinan town of Bugallon. This extraordinary ⁠ location has been witness to significant chapters of my life.",
      "philosophy": "Being young and driven, I possess great ambition to learn and⁠ establish my profession in the area of network security engineering. Compelled by a deep fascination with cybersecurity, My eagerness is to ⁠ explore the intricacies of shielding digital environments from potential threats. With a strong determination to gain expertise and prosper in this particular domain, The idea ⁠ of making valuable contributions to a safe and interconnected tomorrow fills me with enthusiasm. My passion for network⁠ security drives me.",
      "preference": "Being youthful and determined, I constantly pursue my⁠ goals and aspirations with steadfast determination. Compelled by an intense desire to attain outstanding results, I accept difficulties ⁠ as building blocks on the path to a prosperous tomorrow. With ongoing growth and learning, I am steadfast ⁠ in converting my goals into outstanding achievements.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "education": "Education",
        "expertise": "Hobbies",
        "experience": "Experience",
        "contact": "Contact Me"
      }
    },
    "projects": [

      {
        "title": "CodePoint",
        "startDate": "2022",
        "description": "CodePoint is an Android Studio app that helps⁠ prospective programmers on their learning path. It acts as a stepping stone by providing⁠ C++ and Java lectures and activities. Improve your coding abilities with detailed training and⁠ a user-friendly UI provided by the software. Exploring and enhancing your programming talents at your⁠ own pace is made easier with Codepoint. For both newbies and seasoned enthusiasts, it offers⁠ a platform to upgrade your skills. ",
        "images": [
          "images/portfolio/codepoint/p1.png",
          "images/portfolio/codepoint/p2.jpg"
        ],
        "url": "",
        "technologies": [
          
        ]
      },

      {
        "title": "FoodHUB",
        "startDate": "2022",
        "description": "FoodHUB was developed using Flutter and features⁠ a diverse collection of recipes from different parts of the world. The platform is user-friendly for both experienced chefs and⁠ novice cooks, offering easy-to-follow instructions and ingredient lists. This platform guarantees that anyone can prepare⁠ tasty meals in their own kitchen. Whether you desire convenient and straightforward⁠ meals or indulgent gourmet feasts, FoodHUB functions as a culinary partner,⁠ fueling inspiration for cooking. Make the most of this practical recipe app to explore a⁠ diverse array of appetizing dishes and enhance your cooking proficiency.",
        "images": [
          "images/portfolio/foodhub/default.png",
          "images/portfolio/foodhub/untitled22.png"
        ],
        "url": "",
        "technologies": [
          {
          
          
          }
        ]
      },
      
      {
        "title": "Echoes of Resilience",
        "startDate": "On Going",
        "description": "The empathetic game named 'Echoes of ⁠Resilience' was created using Unity. The aim is to raise awareness about unnoticed ⁠ depression and cultivate a supportive atmosphere. By utilizing captivating storytelling and interactive gameplay, players are ⁠ urged to address their emotions and seek assistance. The game enables individuals to face mental health ⁠ challenges by examining the protagonist's journey. 'Echoes of Resilience' is designed to establish a protective and thoughtful atmosphere, ⁠foster emotional well-being, and ignite personal growth for all participants. The quest towards healing has had a notable impact.",
        "images": [
          "images/portfolio/eor/eor1.png",
          "images/portfolio/eor/eor2.png"
        ],
        "url": "",
        "technologies": [
          {
            
          }
        ]
      }
     
    ],
    "education": [
      {
        "company": "PHINMA University of Pangasinan",
        "title": "Information Technology Degree",
        "description": "Currently on my first semester where I will soon be tackling different projects.",
        "years": "2021 - present",
        "mainTech": [
          "Bachelor of Science in Information Technology"
        ],
        "technologies": [
          "Object-Oriented Programming",
          "Web Development",
          "Game Development",
          "Integrated Programming",
          "Advance Database",
          "Database Management System",
          "More to come..."
        ]
      } 
    ],
    "expertise": {
      "icons": [
        {
          "title": "Japanese Language",
          "description": "I studied Japanese at the Polaris Learning and Assessment Center, Inc. Japanese is so intriguing to me that I started studying it, especially now that I'm getting hooked on anime. It would really help me understand the anime without subtitles, but it would also create an opportunity for me to possibly work in Japan."
        },
        {
          "title": "Watching Cybersecurity Related Videos",
          "description": "I am currently getting into cybersecurity in my free time, and it has been very hard, although enjoyable. Learning Linux and other things that are needed to follow the videos that I'm watching is not an easy task, but I think of it as a challenge because this is one of my career choices."
        },
        {
          "title": "Manga",
          "description": "I've fallen profoundly in love with Japanese manga lately. I've finished reading Berserk and Vinland Saga, and I recently started reading The Art of Vagabond by Takehiko Inoue. Highly recommended!"
        },
        {
          "title": "Video Games",
          "description": "I also love playing video games, especially the FPS types. I really liked indie games like Stardew Valley because they helped me relieve stress in my life. Although these days I hardly play because of the heavy workload."
        },
        {
          "title": "Gym",
          "description": "Going to the gym is like going to therapy for me. It helps me alleviate my mood and keep my focus on important things. It also gives me the strength to be confident in myself and to continue improving every day, even if it's just 1%."
        },
        {
          "title": "Reading Books",
          "description": "I rarely read books, but currently I am making it a habit. Self-improvement books such as Atomic Habits and The Art of Not Giving a Fuck are some of my favorites. One of the struggles I've been facing to make it a habit is money. Books are expensive, and I don't want those free e-books online because I also want to reduce my screen time, so yeah."
        }
      ]
    },
    "experience": [
      {
        "company": "PHINMA UPang",
        "title": "Bachelor of Science in Information Technology (BSIT)",
        "description": "I am currently studying BSIT at the PHINMA University of Pangasinan. I believe that persistence and determination in honing my skills and broadening my knowledge are two of my strengths in achieving my goals and dreams in life. At present, my skills sit at:",
        "responsibilities" : [
          "Software Development",
          "Database Management",
          "Game Development",
          "Data Structures and Algorithms",
          "Web Development",
          "Object-Oriented Programming"
          
        ],
        "years": "08.2021 - present",
        "mainTech": [
          "Student"
        ],
        "technologies": [
          "C++",
          "Java",
          "Android Studio",
          "Flutter",
          "JavaScript",
          "NodeJS",
          "Unity",
          "Git"
        ]
      },
      {
        "company": "Self-Study",
        "title": "Cybersecurity",
        "description": "I like to study cybersecurity in my free time, and it really interests me, and it literally becomes one of the aspirations that I have for my career path choice. Currently, I watch video tutorials and lessons about network security engineering. In the near future, I would also apply for workshops to further enhance my knowledge in this field.",
        "responsibilities": [

        ],
        "years": "present",
        "mainTech": [
          ""
        ],
        "technologies": [
          ""
        ]
      }
    ]
}